/* 
객체 하나당 키 
type: 16개의 성격유형 중 하나 (예: INTP)
description: 해당 성격에 대한 설명(창작하기)
기타 다른 키는 본인이 만들고 싶은 앱에 맞게 만들기!
*/		


export const resultcontent = [{
    type: "ISTJ",
    name: "인내심 강한 거북이",
    image: "images/turtle.jpg",
    description: "당신은 계획적이고 논리적이고 책임감이 많아요! 하지만 신중해서 변화나 익숙하지 않은 상황을 마주하면 주저하는 모습을 보여주는군요."
    + " 그럴 때는 천천히 접근을 해보는 것도 좋은 방법인 것 같아요."
  },{
    type: "ISFJ",
    name: "애정 많은 사슴",
    image: "images/deer.jpg",
    description: "당신은 침착함과 끈기가 있고 타인의 감정을 쉽게 알아보는 사람이에요! 그래서 그런지 남의 눈치를 많이 봐요."
    +" 그럴 때는 나를 위한 눈치를 보는 것은 어떨까요?"
  },{
    type: "INFJ",
    name: "대나무 먹는 판다",
    image: "images/panda.jpg",
    description: "상신은 정이 많고, 상대방의 감정에 공감을 잘하고 눈치가 빠른 편이에요! 또한 창의적이고 헌신적이어서"
    +" 획기적인 방법을 제시함으로써 타인을 도와주기도 하죠."
  },{
    type: "INTJ",
    name: "상상력이 풍부한 호랑이",
    image: "images/tiger.jpg",
    description: "당신은 상상력이 풍부하면서도 결단력이 있는 사람이에요! 또한 독립심이 강하고, 목표 지향적이며," 
    +" 엄격한 분위기와는 다르게 친구로 지내기에 편안한 유형이에요."
  },{
    type: "ISTP",
    name: "마이웨이 곰",
    image: "images/bear.jpg",
    description: "인생은 마이웨이죠~ 가끔 이상한 부분에서 혼자 웃는데 남 눈치는 안봐요. 그리고 내향적이라 조용한 모습을 보일 때가 많지만"
    +" 때에 따라 외향적으로 보일 만큼 변하며 완벽주의 성향이 강하고 모험과 스릴을 좋아해요. "
  },{
    type: "ISFP",
    name: "세심한 고양이",
    image: "images/cat.jpg",
    description: "당신은 게으른 완벽주의자군요! 친한 친구라도 연락하는 게 귀찮을 때가 많아요. 항상 핸드폰을 잡고 있는 사람들이 오히려 신기하다고 생각해요."
    +" 그리고 외로움은 많이 타는데 많은 사람들과 있는 것은 싫어하고, 조용하고 진지해보이지만 생각이 많고 상상력이 풍부해요."
  },{
    type: "INFP",
    name: "완벽쟁이 앵무새",
    image: "images/parrot.jpg",
    description: "당신은 완벽하게 하지 못할 거면 아예 시작하지 않는 사람이군요! 좋아하는 것은 미친듯이 집중하지만 열정이 초기에만 불타고 빨리 식어요."
    +" 그리고 해야 될 일을 생각만 하고 실제로는 발만 담그고 안하는 경향이 있어요."
  },{
    type: "INTP",
    name: "현명한 부엉이",
    image: "images/owl.jpg",
    description: "당신은 분석하고 비판하는 일에 재미를 느끼는 사람이군요! 주로 혼자 생각할 때가 많아 남들이 보기에는 게을러 보일 수 있어요."
    +" 하지만 그 시간에도 당신의 머릿속은 쉴새없이 돌아가고 있지요. 평소에는 말을 아끼다가도 관심분야에 대해서는 뛰어난 통찰력을 보여줘요."
  },{
    type: "ESTP",
    name: "관종 공작새",
    image: "images/peacock.jpg",
    description: "당신은 행사에서 어렵지 않게 볼 수 있는 사람이에요! 주변의 이목을 끄는 것을 좋아하며 삶을 즐기며 살아요."
    +" 또한 날카로운 관찰력과 기억력을 가지고 있으며 호기심도 많은 편이에요!"
  },{
    type: "ESFP",
    name: "수다스러운 돌고래",
    image: "images/dolphin.jpg",
    description: "당신은 분위기메이커에요! 사교적이고 다른 사람들과 함께 시간을 보내면서 행복을 느끼고, 다른 사람들에게 관심받는 것을 즐겨요. "
    + " 또한 새로운 것을 추구하며 직접 행동으로 느껴보는 것을 선호해요"
  },{
    type: "ENFP",
    name: "유쾌한 원숭이",
    image: "images/monkey.jpg",
    description: "당신은 상상력이 풍부하고, 활발하고 유쾌한 사람이에요! 관심사가 다양하며 흥미있는 일을 빨리 배우고,"
    +" 새로운 사람을 만나는 것과 새로운 것을 시도하는 것을 좋아해요. 하지만 단조롭게 반복되는 일을 싫어해요!"
  },{
    type: "ENTP",
    name: "열정가득 여우",
    image: "images/fox.jpg",
    description: "당신은 열정가득 뜨거운 사람이군요! 열정이 많아서 폭넓은 관심사와 취미를 가졌고, 관심 있는 건 뭐든지 잘 할 수 있어요."
    +"  또한 일단 저지르고 보는 스타일! 충동적인 면이 있고, 창의적인 것이 좋고 새로운 걸 찾고 싶어해요."
  },{
    type: "ESTJ",
    name:  "똑 부러지는 늑대",
    image: "images/wolf.jpg",
    description: "당신은 지도자 기질을 가지고 있군요! 기억력이 좋고, 계획을 차근차근 해나가는 성격이에요." 
    +" 또한 어질러지거나 난장판인 책상을 잘 보지 못하고, 객관적이고 확실한 사람이에요. 애매모호한 건 딱 질색!"
  },{
    type: "ESFJ",
    name: "온화한 코끼리",
    image: "images/elephant.jpg",
    description: "당신은 16가지 성격 중에서 가장 친절하고 사회성이 좋은 사람이에요!"
    + " 여러 모임에 참여하는 것을 즐기며 리액션이 좋아서 모임에서 주목을 잘 받고, 다른 사람을 돕는 것을 좋아하는 군요."
    + " 그리고 눈치가 빠르고 상대방의 시선을 신경 쓰는 경향이 있어요!"
  },{
    type: "ENFJ",
    name: "충성스러운 강아지",
    image: "images/dog.jpg",
    description: "당신은 사람을 좋아하며 친절하고 재치있어요! 나보다 상대를 먼저 생각해서 말과 행동을 하지만"
    +" 상대방을 지나치게 배려하고, 막상 본인이 어려움에 쳐했을 때 도움을 요청하지 못하는 경우가 많아요. "
  },{
    type: "ENTJ",
    name: "정글의 왕, 사자",
    image: "images/lion.jpg",
    description: "당신은 넘치는 카리스마와 자신감으로 다른 사람들을 이끌어요! 갈등을 피하지 않고 토론을 즐기며"
    +" 전체적인 측면에서 시야가 넓지만 목표 달성을 위해 가끔은 무모하게 이성적 사고를 하고, 직설적인 화법으로 갈등을 일으킬 수 있어요."
  }]